<?xml version="1.0"?>
<net name="onnx_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="spatial_in" type="Parameter" version="opset1">
			<data shape="1,3,224,224" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="spatial_in">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="freq_in" type="Parameter" version="opset1">
			<data shape="1,2,224,224" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="freq_in">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="freq_in/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="3" name="freq_in/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="4" name="freq_in/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="5" name="freq_in/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="6" name="freq_in/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_247843" type="Const" version="opset1">
			<data element_type="i8" shape="32, 2, 3, 3" offset="8" size="576" />
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Convert_247844" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_247845" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 1" offset="584" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/freq_stream/freq_stream.0/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/freq_stream/freq_stream.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Reshape_1997" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="712" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/freq_stream/freq_stream.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/freq_stream/freq_stream.0/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/freq_stream/freq_stream.2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/freq_stream/freq_stream.2/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/freq_stream/freq_stream.2/Relu/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="16" name="/freq_stream/freq_stream.2/Relu/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="840" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="17" name="/freq_stream/freq_stream.2/Relu/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="18" name="/freq_stream/freq_stream.2/Relu/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="840" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="19" name="/freq_stream/freq_stream.2/Relu/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/freq_stream/freq_stream.3/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/freq_stream/freq_stream.3/MaxPool_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_247847" type="Const" version="opset1">
			<data element_type="i8" shape="64, 32, 3, 3" offset="844" size="18432" />
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Convert_247848" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_247849" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 1" offset="19276" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/freq_stream/freq_stream.4/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/freq_stream/freq_stream.4/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/freq_stream/freq_stream.4/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/freq_stream/freq_stream.6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/freq_stream/freq_stream.6/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/freq_stream/freq_stream.6/Relu/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="28" name="/freq_stream/freq_stream.6/Relu/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="19532" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="29" name="/freq_stream/freq_stream.6/Relu/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="30" name="/freq_stream/freq_stream.6/Relu/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="19532" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="31" name="/freq_stream/freq_stream.6/Relu/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Range_2023" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="19536" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/freq_stream/freq_stream.7/GlobalAveragePool" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/freq_stream/freq_stream.7/GlobalAveragePool_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/freq_stream/freq_stream.7/GlobalAveragePool/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="19552" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="35" name="/freq_stream/freq_stream.7/GlobalAveragePool/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="19556" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="36" name="/freq_stream/freq_stream.7/GlobalAveragePool/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="19552" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="37" name="/freq_stream/freq_stream.7/GlobalAveragePool/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="19556" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="38" name="/freq_stream/freq_stream.7/GlobalAveragePool/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_2027" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="19560" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/Flatten_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Flatten_1_output_0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_247851" type="Const" version="opset1">
			<data element_type="i8" shape="6272, 64" offset="19576" size="401408" />
			<output>
				<port id="0" precision="I8">
					<dim>6272</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Convert_247852" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>6272</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>6272</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_247853" type="Const" version="opset1">
			<data element_type="f32" shape="6272, 1" offset="420984" size="25088" />
			<output>
				<port id="0" precision="FP32">
					<dim>6272</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/recon_head/recon_head.0/Gemm/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>6272</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>6272</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>6272</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/recon_head/recon_head.0/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>6272</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>6272</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_9408" type="Const" version="opset1">
			<data element_type="f32" shape="1, 6272" offset="446072" size="25088" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6272</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/recon_head/recon_head.0/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6272</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>6272</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/recon_head/recon_head.0/Gemm_output_0">
					<dim>1</dim>
					<dim>6272</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/recon_head/recon_head.1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6272</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/recon_head/recon_head.1/Relu_output_0">
					<dim>1</dim>
					<dim>6272</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/recon_head/recon_head.1/Relu/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="50" name="/recon_head/recon_head.1/Relu/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="471160" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="51" name="/recon_head/recon_head.1/Relu/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="52" name="/recon_head/recon_head.1/Relu/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="471160" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="53" name="/recon_head/recon_head.1/Relu/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6272</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>6272</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_9490" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="471164" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/recon_head/recon_head.2/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6272</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/recon_head/recon_head.2/Reshape_2_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/recon_head/recon_head.3/Constant_output_0" type="Const" version="opset1">
			<data element_type="f32" shape="4" offset="471196" size="16" />
			<output>
				<port id="0" precision="FP32" names="/recon_head/recon_head.3/Constant_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/recon_head/recon_head.3/Resize" type="Interpolate" version="opset11">
			<data mode="nearest" shape_calculation_mode="scales" coordinate_transformation_mode="asymmetric" nearest_mode="floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/recon_head/recon_head.3/Resize_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/recon_head/recon_head.3/Resize/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="59" name="/recon_head/recon_head.3/Resize/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="471160" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="60" name="/recon_head/recon_head.3/Resize/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="61" name="/recon_head/recon_head.3/Resize/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="471160" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="62" name="/recon_head/recon_head.3/Resize/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_247855" type="Const" version="opset1">
			<data element_type="i8" shape="2, 128, 3, 3" offset="471212" size="2304" />
			<output>
				<port id="0" precision="I8">
					<dim>2</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Convert_247856" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>2</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_247857" type="Const" version="opset1">
			<data element_type="f32" shape="2, 1, 1, 1" offset="473516" size="8" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/recon_head/recon_head.4/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/recon_head/recon_head.4/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Reshape_2096" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2, 1, 1" offset="473524" size="8" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/recon_head/recon_head.4/Conv_output_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/recon_head/recon_head.4/Conv_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="spatial_in/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="71" name="spatial_in/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="473532" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="72" name="spatial_in/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="73" name="spatial_in/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="473532" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="74" name="spatial_in/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_247859" type="Const" version="opset1">
			<data element_type="i8" shape="32, 3, 3, 3" offset="473536" size="864" />
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Convert_247860" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_247861" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 1" offset="474400" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/backbone/backbone.0/backbone.0.0/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/backbone/backbone.0/backbone.0.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/backbone.0/backbone.0.0/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/backbone/backbone.0/backbone.0.2/HardSwish" type="HSwish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/backbone.0/backbone.0.2/HardSwish_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/backbone/backbone.0/backbone.0.2/HardSwish/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="474528" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/backbone/backbone.0/backbone.0.2/HardSwish/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="474656" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/backbone/backbone.0/backbone.0.2/HardSwish/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="474528" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/backbone/backbone.0/backbone.0.2/HardSwish/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="474656" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/backbone/backbone.0/backbone.0.2/HardSwish/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_247863" type="Const" version="opset1">
			<data element_type="i8" shape="32, 1, 1, 3, 3" offset="474784" size="288" />
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Convert_247864" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_247865" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 1, 1" offset="475072" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Multiply_8751/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Multiply_8751" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/backbone.1/backbone.1.0/block/block.0/Conv_output_0,/backbone/backbone.1/backbone.1.0/block/block.1/BatchNormalization_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/backbone/backbone.1/backbone.1.0/block/block.2/HardSwish" type="HSwish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/backbone.1/backbone.1.0/block/block.2/HardSwish_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/backbone/backbone.1/backbone.1.0/block/block.2/HardSwish/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="475200" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="93" name="/backbone/backbone.1/backbone.1.0/block/block.2/HardSwish/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="475204" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="94" name="/backbone/backbone.1/backbone.1.0/block/block.2/HardSwish/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="475200" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="95" name="/backbone/backbone.1/backbone.1.0/block/block.2/HardSwish/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="475204" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="96" name="/backbone/backbone.1/backbone.1.0/block/block.2/HardSwish/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Range_77" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="19536" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/backbone/backbone.1/backbone.1.0/block/block.3/avgpool/GlobalAveragePool" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/backbone.1/backbone.1.0/block/block.3/avgpool/GlobalAveragePool_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/backbone/backbone.1/backbone.1.0/block/block.3/avgpool/GlobalAveragePool/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="475208" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="100" name="/backbone/backbone.1/backbone.1.0/block/block.3/avgpool/GlobalAveragePool/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="475212" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="101" name="/backbone/backbone.1/backbone.1.0/block/block.3/avgpool/GlobalAveragePool/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="475208" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="102" name="/backbone/backbone.1/backbone.1.0/block/block.3/avgpool/GlobalAveragePool/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="475212" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="103" name="/backbone/backbone.1/backbone.1.0/block/block.3/avgpool/GlobalAveragePool/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_247867" type="Const" version="opset1">
			<data element_type="i8" shape="8, 32, 1, 1" offset="475216" size="256" />
			<output>
				<port id="0" precision="I8">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Convert_247868" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_247869" type="Const" version="opset1">
			<data element_type="f32" shape="8, 1, 1, 1" offset="475472" size="32" />
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/backbone/backbone.1/backbone.1.0/block/block.3/fc1/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/backbone/backbone.1/backbone.1.0/block/block.3/fc1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Reshape_94" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="475504" size="32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/backbone/backbone.1/backbone.1.0/block/block.3/fc1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/backbone.1/backbone.1.0/block/block.3/fc1/Conv_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/backbone/backbone.1/backbone.1.0/block/block.3/activation/HardSwish" type="HSwish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/backbone.1/backbone.1.0/block/block.3/activation/HardSwish_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/backbone/backbone.1/backbone.1.0/block/block.3/activation/HardSwish/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="475536" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="113" name="/backbone/backbone.1/backbone.1.0/block/block.3/activation/HardSwish/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="475540" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="114" name="/backbone/backbone.1/backbone.1.0/block/block.3/activation/HardSwish/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="475536" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="115" name="/backbone/backbone.1/backbone.1.0/block/block.3/activation/HardSwish/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="475540" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="116" name="/backbone/backbone.1/backbone.1.0/block/block.3/activation/HardSwish/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Constant_247871" type="Const" version="opset1">
			<data element_type="i8" shape="32, 8, 1, 1" offset="475544" size="256" />
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Convert_247872" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_247873" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 1" offset="475800" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="/backbone/backbone.1/backbone.1.0/block/block.3/fc2/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/backbone/backbone.1/backbone.1.0/block/block.3/fc2/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Reshape_110" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="475928" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="/backbone/backbone.1/backbone.1.0/block/block.3/fc2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/backbone.1/backbone.1.0/block/block.3/fc2/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="/backbone/backbone.1/backbone.1.0/block/block.3/scale_activation/Sigmoid" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/backbone.1/backbone.1.0/block/block.3/scale_activation/Sigmoid_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Constant_9409" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Constant_9410" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="476056" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
